Revit 2027 API
SizingCalculator.EquivalentDiameter Method
 Calculates the equivalent diameter based on the specified profile type, width, and height.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EquivalentDiameter(
	ConnectorProfileType eShape,
	double widthOrDiameter,
	double height
)
Public Function EquivalentDiameter (
	eShape As ConnectorProfileType,
	widthOrDiameter As Double,
	height As Double
) As Double
public:
double EquivalentDiameter(
	ConnectorProfileType eShape,
	double widthOrDiameter,
	double height
)
member EquivalentDiameter :
        eShape : ConnectorProfileType *
        widthOrDiameter : float *
        height : float -> float
Parameters
eShape ConnectorProfileType
 The shape of the connector profile.
widthOrDiameter Double
 The width or diameter of the connector.
height Double
 The height of the connector.
Return Value
Double
 Returns the calculated equivalent diameter.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace